content/roam/20211012160401-veos_production_plan.org
:PROPERTIES:
:ID:       b37a3d2a-9138-4625-89a5-457373c00324
:END:
#+title: veos-production-plan
#+CATEGORY: Projects
#+filetags: :veos:
[[./20210830182658-veos.org][veos]]
* Gap to Production
** Development
*** data ingestion
**** Interface confirmation
***** Flashing
****** Frequency (InTest)
***** Observation
****** speed, throttle & brake pedal
****** voltage, current
*** data digestion
**** Function Maintainence and Upgrade
***** Pretraining and episodic
***** Episode-free inference
***** RDPG (Serial States Encoding)
***** Memory and warm startup
***** Multi Agents
***** distribution drifting impact
*** excrement, deposition and regurgitation
**** offline data deposition
*** Test fleet
**** Vehicle reworking
***** KVaser
***** CarPC/laptop
***** Inverter and cables
**** SW: Python only Interface (Company Windows system + Conda):
***** data collection
***** monitoring,
***** HMI,
***** Training
***** Inference
*** Test Drive
**** a different triangle profile
**** multi-triangle profile
**** New Anting Town
***** Baseline
***** Episode free, inference only
***** Extra module: HDMap, Traffic Light Detection
***** expanded action space 0~35kmph/8 rows
****** observation determines the activated action space!
******* just assumption, where observation is only related to the corresponding action with the same speed!
******* in reality, low speed observation may affect high speed action.
******* but in analogy to convolution neural network, the policy could be shared between different action space
******* the same DDPG shared for different speed interval! translation invariant in observation & action space? scale separation (0~20kmph-->0~100kmph)?
**** Highway
** Test and Validation
*** Trip Sync
**** Production over the Infotainment (manual button, internal http, navigation)
**** Test
***** STARTED [#C] Sync over UDP
- State "STARTED"    from "DONE"       [2022-08-04 Thu 10:01]
****** Vehicle: Trip logic, HMI, inferring
****** Cloud: data, training
******* 4G: fetch data from cloud
***** Sync over the Air
