20211012160401-veos_production_plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>veos-production-plan</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">veos-production-plan</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf7893f0">Gap to Production</a>
<ul>
<li><a href="#org22c569b">Development</a>
<ul>
<li><a href="#org777eaaa">data ingestion</a></li>
<li><a href="#org66ec496">data digestion</a></li>
<li><a href="#orga91aa99">excrement, deposition and regurgitation</a></li>
<li><a href="#org8ead24f">Test fleet</a></li>
<li><a href="#org82df83e">Test Drive</a></li>
</ul>
</li>
<li><a href="#org56e91e3">Test and Validation</a>
<ul>
<li><a href="#orgc02c51f">Trip Sync</a></li>
<li><a href="#org586bcac">AI mode switch</a></li>
<li><a href="#orgd8263b2">Safety?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc9ca3d6">EC1-Production</a>
<ul>
<li><a href="#orgf543fe9">communication</a>
<ul>
<li><a href="#org9aafde7">inference on the cloud</a></li>
<li><a href="#orgad92f85">decision data dispatch through tbox (remote CAN, 4G and ccp) to VBU</a></li>
</ul>
</li>
<li><a href="#org903d934">training</a>
<ul>
<li><a href="#org437ecb4">online (off policy): upload on the cloud, dispatch</a></li>
<li><a href="#org4d08998">offline: upload, storage and offline training</a></li>
</ul>
</li>
<li><a href="#org569dd7a">data</a>
<ul>
<li><a href="#org7b0fa6a">cloud</a></li>
</ul>
</li>
<li><a href="#orgc87565d">equipment</a>
<ul>
<li><a href="#org409b065">VB sample with</a></li>
<li><a href="#org4d66b5a">Cloud cluster</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb2cd828"><span class="todo TODO">TODO</span> ADP Plan</a>
<ul>
<li><a href="#orgc5d5ae6">Goal</a>
<ul>
<li><a href="#org56b9a5d">Priority: function, performance;</a></li>
<li><a href="#org941fed3">robust (noise?)</a></li>
<li><a href="#orgbd5f165">safety (risk?)</a></li>
</ul>
</li>
<li><a href="#orgd2fcefa"><span class="todo TODO">TODO</span> review the interface: requriment vs implementation</a>
<ul>
<li><a href="#orgc41451c">状态读取（上传）以云端为主体: 短消息，快，1.5 秒，上传后在云端存储</a></li>
<li><a href="#orgc58b133">刷写（下发）</a></li>
</ul>
</li>
<li><a href="#org9ae6f31"><span class="todo TODO">TODO</span> test the interface</a>
<ul>
<li><a href="#org50ab56f">upload</a></li>
<li><a href="#orgf25d186">download</a></li>
</ul>
</li>
<li><a href="#orgfcf38d8"><span class="todo TODO">TODO</span> single test vehicle: freeze the 1st version to have a test training and validation</a>
<ul>
<li><a href="#org8f92ef2"><span class="todo TODO">TODO</span> cloud cluster setup and test</a></li>
<li><a href="#orgef119b4"><span class="todo TODO">TODO</span> ddpg/rdpg real-time with remotecan to test the realtimeness</a></li>
<li><a href="#org35d1d53"><span class="todo TODO">TODO</span> ddpg/rdpg offline training/learning &amp; realtime inference</a></li>
<li><a href="#org13d275d"><span class="todo TODO">TODO</span> ddpg/rdgp offline training/learning &amp; inference with big timegap (latency, data loss)</a></li>
</ul>
</li>
<li><a href="#orgf1bdc8e"><span class="todo TODO">TODO</span> review the performance and feasiblity</a></li>
<li><a href="#orge2b407c"><span class="todo TODO">TODO</span> batch test: (multiple vehicles)</a></li>
<li><a href="#org670a36a"><span class="todo TODO">TODO</span> System Concept (different from test concept, final evaluation)</a>
<ul>
<li><a href="#org188f2e8"><span class="todo TODO">TODO</span> Lower Bound: no real-time download and upload, just offline assessment</a></li>
<li><a href="#orge4a44ce"><span class="todo TODO">TODO</span> Expected Performance:</a></li>
<li><a href="#orgfae1cc9"><span class="todo TODO">TODO</span> Upper Bound:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9f2abe7">EC1 Training</a>
<ul>
<li><a href="#org309f944">Responsibility</a>
<ul>
<li><a href="#org53a147b"><span class="todo TODO">TODO</span> provide methods and instruction, analysis of the training data, debugging</a></li>
<li><a href="#org4f25ae4">No support for actual testing,</a></li>
</ul>
</li>
<li><a href="#org61b3d8b">high quality training (due to inference only mode in EC1)</a>
<ul>
<li><a href="#org03036f5"><span class="todo TODO">TODO</span> quality and efficiency assessment (eos/)</a></li>
<li><a href="#org1cf1126">Anting training is better than Jiangyin.</a></li>
<li><a href="#org5e7c100">If no training in Anting, only depending training in Jiangyin, already specified (assessing quality of the training based on the specification！)</a></li>
</ul>
</li>
<li><a href="#org9802eb8">high quality remotecan signal, responsibility?</a>
<ul>
<li><a href="#org2737606"><span class="todo TODO">TODO</span> quality assessemnt (eos/remotecan itself)</a></li>
<li><a href="#org728fbb1"><span class="todo TODO">TODO</span> improve remotecan?</a></li>
</ul>
</li>
<li><a href="#org44c359f">Analysis</a>
<ul>
<li><a href="#orgbff1697"><span class="todo TODO">TODO</span> Development test</a></li>
<li><a href="#org0db9b8d"><span class="todo TODO">TODO</span> training with new version</a></li>
<li><a href="#orgb3e864c"><span class="todo TODO">TODO</span> inference with new version</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4008a9a"><span class="todo TODO">TODO</span> EC1 assessemnt</a>
<ul>
<li><a href="#org6ff74f7"><span class="todo TODO">TODO</span> safety, again?</a></li>
<li><a href="#orgd794cfb"><span class="todo TODO">TODO</span> efficiency? not included.</a></li>
<li><a href="#org748d27e"><span class="todo TODO">TODO</span> Not responsible for evaluation, already proved in ADP, with the best algorithm deep rl!</a></li>
<li><a href="#orgd99f133"><span class="todo TODO">TODO</span> only support for analysis</a></li>
</ul>
</li>
<li><a href="#orgd253ac8">EOS Software</a>
<ul>
<li><a href="#org92e560f">Production level software packaage</a></li>
<li><a href="#orga7dbd9a">scalable, cluster ready</a>
<ul>
<li><a href="#org7f8a41e">algorithms, tensorflow on cluster, optimized</a></li>
<li><a href="#org287268f">Data storage solution: tailored time series database (faster than MongoDB)</a></li>
<li><a href="#orgf362476">Data Processing interface</a></li>
<li><a href="#orgd930170">Vector logging analysis: fast statistics extraction and timing analysis, fast signal quality anaylis and validation</a></li>
<li><a href="#org579fa8e">EOS Exception handling</a></li>
</ul>
</li>
<li><a href="#org70f5a7f">Full typing with mypy, dataclass and pydantic</a>
<ul>
<li><a href="#orgdbdae17">mypy config on package and module levels</a></li>
<li><a href="#org83e5468">create stubs for own modules and class</a></li>
<li><a href="#orgdf074fb">overriding optional with constructors</a></li>
</ul>
</li>
<li><a href="#org9841769">Extendable architecture</a>
<ul>
<li><a href="#orgb22f9d4">integration of multiple input interface (local/remote)</a></li>
<li><a href="#org3d93523">integration of multiple storage interface (database, local files, cluster interface)</a></li>
<li><a href="#orgb6f4b3d">integration of polymorphic agent (DDPG/RDPG)</a></li>
<li><a href="#orgc2d9629">Production configuration system with validation: Vehicle/Driver/Storage config, VCU, TBox, Driver management</a></li>
<li><a href="#orgce28f39"><span class="todo TODO">TODO</span> DL training/testing metrics with W&amp;B</a></li>
<li><a href="#orga2ff6a5"><span class="todo TODO">TODO</span> Time series processing with Transformer architecture</a></li>
<li><a href="#orgfbfb27c"><span class="todo TODO">TODO</span> Offline Reinforcement Learning investigation, EDA of offline data</a></li>
<li><a href="#orgb9841fc"><span class="todo TODO">TODO</span> Foundational Model for VEOS （prediction and decision, LLM-agent)</a></li>
<li><a href="#orgf86c965"><span class="todo TODO">TODO</span> Spark extention to Eos Storage</a></li>
<li><a href="#org9fd4071"><span class="todo TODO">TODO</span> MapReduce pipeline for veos analysis: statistics,</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6cfcd15">EOS Algorithms</a>
<ul>
<li><a href="#org4527239">Offline Reinforcement Learning CQL, etc.</a></li>
<li><a href="#org18745e0">Transformer substitute LSTM</a></li>
<li><a href="#orgcf58da2">Foundational Model for time series</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       b37a3d2a-9138-4625-89a5-457373c00324
</p>
<p>
<a href="./20210830182658-veos.html">veos</a>
</p>
<div id="outline-container-orgf7893f0" class="outline-2">
<h2 id="orgf7893f0">Gap to Production</h2>
<div class="outline-text-2" id="text-orgf7893f0">
</div>
<div id="outline-container-org22c569b" class="outline-3">
<h3 id="org22c569b">Development</h3>
<div class="outline-text-3" id="text-org22c569b">
</div>
<div id="outline-container-org777eaaa" class="outline-4">
<h4 id="org777eaaa">data ingestion</h4>
<div class="outline-text-4" id="text-org777eaaa">
</div>
<ul class="org-ul">
<li><a id="org369f0af"></a>Interface confirmation<br />
<ul class="org-ul">
<li><a id="org7c1ce46"></a>Flashing<br />
<ul class="org-ul">
<li><a id="orge66bbe5"></a>Frequency (InTest)<br /></li>
</ul>
</li>
<li><a id="org47d2b06"></a>Observation<br />
<ul class="org-ul">
<li><a id="org181150c"></a>speed, throttle &amp; brake pedal<br /></li>
<li><a id="orgacdf1ea"></a>voltage, current<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org66ec496" class="outline-4">
<h4 id="org66ec496">data digestion</h4>
<div class="outline-text-4" id="text-org66ec496">
</div>
<ul class="org-ul">
<li><a id="org15e4f27"></a>Function Maintainence and Upgrade<br />
<ul class="org-ul">
<li><a id="org33e7f5c"></a>Pretraining and episodic<br /></li>
<li><a id="orgc48441a"></a>Episode-free inference<br /></li>
<li><a id="org6b78553"></a>RDPG (Serial States Encoding)<br /></li>
<li><a id="orgc98e3eb"></a>Memory and warm startup<br /></li>
<li><a id="org57a0aa1"></a>Multi Agents<br /></li>
<li><a id="org15c5660"></a>distribution drifting impact<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orga91aa99" class="outline-4">
<h4 id="orga91aa99">excrement, deposition and regurgitation</h4>
<div class="outline-text-4" id="text-orga91aa99">
</div>
<ul class="org-ul">
<li><a id="orgcb870a9"></a>offline data deposition<br /></li>
</ul>
</div>
<div id="outline-container-org8ead24f" class="outline-4">
<h4 id="org8ead24f">Test fleet</h4>
<div class="outline-text-4" id="text-org8ead24f">
</div>
<ul class="org-ul">
<li><a id="org231caf5"></a>Vehicle reworking<br />
<ul class="org-ul">
<li><a id="org22823ab"></a>KVaser<br /></li>
<li><a id="org0fd2540"></a>CarPC/laptop<br /></li>
<li><a id="orgbf601cd"></a>Inverter and cables<br /></li>
</ul>
</li>
<li><a id="org0ec8c38"></a>SW: Python only Interface (Company Windows system + Conda):<br />
<ul class="org-ul">
<li><a id="org1312d2c"></a>data collection<br /></li>
<li><a id="org71ed659"></a>monitoring,<br /></li>
<li><a id="org1d524fd"></a>HMI,<br /></li>
<li><a id="orgbc07aea"></a>Training<br /></li>
<li><a id="org6864c5d"></a>Inference<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org82df83e" class="outline-4">
<h4 id="org82df83e">Test Drive</h4>
<div class="outline-text-4" id="text-org82df83e">
</div>
<ul class="org-ul">
<li><a id="org9dfb130"></a>a different triangle profile<br /></li>
<li><a id="org8fda672"></a>multi-triangle profile<br /></li>
<li><a id="org05fecd6"></a>New Anting Town<br />
<ul class="org-ul">
<li><a id="org7e644fc"></a>Baseline<br /></li>
<li><a id="org564bf02"></a>Episode free, inference only<br /></li>
<li><a id="orge8a8942"></a>Extra module: HDMap, Traffic Light Detection<br /></li>
<li><a id="org0f5edd7"></a>expanded action space 0~35kmph/8 rows<br />
<ul class="org-ul">
<li><a id="org9c0b5aa"></a>observation determines the activated action space!<br />
<ul class="org-ul">
<li><a id="org4ce04e9"></a>just assumption, where observation is only related to the corresponding action with the same speed!<br /></li>
<li><a id="org9372166"></a>in reality, low speed observation may affect high speed action.<br /></li>
<li><a id="orgb3be7c1"></a>but in analogy to convolution neural network, the policy could be shared between different action space<br /></li>
<li><a id="org1955ff1"></a>the same DDPG shared for different speed interval! translation invariant in observation &amp; action space? scale separation (0~20kmph&#x2013;&gt;0~100kmph)?<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a id="org51c3233"></a>Highway<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org56e91e3" class="outline-3">
<h3 id="org56e91e3">Test and Validation</h3>
<div class="outline-text-3" id="text-org56e91e3">
</div>
<div id="outline-container-orgc02c51f" class="outline-4">
<h4 id="orgc02c51f">Trip Sync</h4>
<div class="outline-text-4" id="text-orgc02c51f">
</div>
<ul class="org-ul">
<li><a id="orgc4134a7"></a>Production over the Infotainment (manual button, internal http, navigation)<br /></li>
<li><a id="org3a9d00c"></a>Test<br />
<ul class="org-ul">
<li><a id="org9e46385"></a>STARTED [#C] Sync over UDP<br />
<div class="outline-text-6" id="text-org9e46385">
<ul class="org-ul">
<li>State "STARTED"    from "DONE"       <span class="timestamp-wrapper"><span class="timestamp">[2022-08-04 Thu 10:01]</span></span></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgb785cc1"></a>Vehicle: Trip logic, HMI, inferring<br /></li>
<li><a id="orgca844a5"></a>Cloud: data, training<br />
<ul class="org-ul">
<li><a id="org0517059"></a>4G: fetch data from cloud<br /></li>
</ul>
</li>
</ul>
</li>
<li><a id="orge4a4b6e"></a>Sync over the Air<br />
<ul class="org-ul">
