content/roam/20211012160401-veos_production_plan.org
****** Vehicle: Trip logic, HMI
******* 4G: Sync signal
****** Cloud: training, inferring
*** AI mode switch
**** Notify (Inquire)
*** Safety?
**** motor
**** driving
**** torque range
**** change rate
* EC1-Production
** communication
*** inference on the cloud
*** decision data dispatch through tbox (remote CAN, 4G and ccp) to VBU
** training
*** online (off policy): upload on the cloud, dispatch
*** offline: upload, storage and offline training
** data
*** cloud
**** model data
**** training data
***** offline storage
***** 2database for inquiry
** equipment
*** VB sample with
**** TBOX
**** VBU
*** Cloud cluster
**** inference
***** runtime
***** realtime observation transmission
***** realtime policy execution
**** training
***** database; observation/model/logs storage search and fetch
***** training runtime
* TODO ADP Plan
DEADLINE: <2022-08-31 Wed>
** Goal
*** Priority: function, performance;
*** robust (noise?)
*** safety (risk?)
** TODO [#A] review the interface: requriment vs implementation
SCHEDULED: <2022-02-18 Fri>
*** 状态读取（上传）以云端为主体: 短消息，快，1.5 秒，上传后在云端存储
*** 刷写（下发）
** TODO [#A] test the interface
DEADLINE: <2022-02-25 Fri>
*** upload
*** download
** TODO [#A] single test vehicle: freeze the 1st version to have a test training and validation
SCHEDULED: <2022-03-30 Wed>
*** TODO cloud cluster setup and test
*** TODO ddpg/rdpg real-time with remotecan to test the realtimeness
*** TODO ddpg/rdpg offline training/learning & realtime inference
*** TODO ddpg/rdgp offline training/learning & inference with big timegap (latency, data loss)
** TODO [#B] review the performance and feasiblity
SCHEDULED: <2022-05-04 Wed>
** TODO [#A] batch test: (multiple vehicles)
SCHEDULED: <2022-06-08 Wed>
** TODO System Concept (different from test concept, final evaluation)
SCHEDULED: <2022-07-15 Fri>
*** TODO Lower Bound: no real-time download and upload, just offline assessment
**** static optimal pedal map with pre-training （urban eco & highway eco & ... etc. )
*** TODO Expected Performance:
**** update when scenario changes smoothly MPC (adaptive changing), from urban --> highway
***** pretraining on highway
***** scenario changes
***** online update in urban street
*** TODO Upper Bound:
**** realtime dynamic optimal pedal map with online updating (5s observation immediate after flashing/download;)
[[./20220406134513-veos_adp.org][veos-adp]]
* EC1 Training
** Responsibility
*** TODO provide methods and instruction, analysis of the training data, debugging
*** No support for actual testing,
** high quality training (due to inference only mode in EC1)
*** TODO quality and efficiency assessment (eos/)
*** Anting training is better than Jiangyin.
*** If no training in Anting, only depending training in Jiangyin, already specified (assessing quality of the training based on the specification！)
** high quality remotecan signal, responsibility?
*** TODO quality assessemnt (eos/remotecan itself)
*** TODO improve remotecan?
**** if no, decision for abandoning improvement? resource/timing/difficulty, argument?
**** TODO if yes, how?
** Analysis
*** TODO Development test
**** minimum 1 month, 3 weeks is insufficient, will have to debug remotely
*** TODO training with new version
*** TODO inference with new version
* TODO EC1 assessemnt
** TODO safety, again?
** TODO efficiency? not included.
** TODO Not responsible for evaluation, already proved in ADP, with the best algorithm deep rl!
** TODO only support for analysis
* EOS Software
** Production level software packaage
