20211012160401-veos_production_plan.html
<li><a id="org4eb82aa"></a>Vehicle: Trip logic, HMI<br />
<ul class="org-ul">
<li><a id="org3af52bb"></a>4G: Sync signal<br /></li>
</ul>
</li>
<li><a id="org436fcaf"></a>Cloud: training, inferring<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org586bcac" class="outline-4">
<h4 id="org586bcac">AI mode switch</h4>
<div class="outline-text-4" id="text-org586bcac">
</div>
<ul class="org-ul">
<li><a id="orgc8804dc"></a>Notify (Inquire)<br /></li>
</ul>
</div>
<div id="outline-container-orgd8263b2" class="outline-4">
<h4 id="orgd8263b2">Safety?</h4>
<div class="outline-text-4" id="text-orgd8263b2">
</div>
<ul class="org-ul">
<li><a id="org9317891"></a>motor<br /></li>
<li><a id="orgdfdac23"></a>driving<br /></li>
<li><a id="orgc5f8abf"></a>torque range<br /></li>
<li><a id="org3fc65df"></a>change rate<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc9ca3d6" class="outline-2">
<h2 id="orgc9ca3d6">EC1-Production</h2>
<div class="outline-text-2" id="text-orgc9ca3d6">
</div>
<div id="outline-container-orgf543fe9" class="outline-3">
<h3 id="orgf543fe9">communication</h3>
<div class="outline-text-3" id="text-orgf543fe9">
</div>
<div id="outline-container-org9aafde7" class="outline-4">
<h4 id="org9aafde7">inference on the cloud</h4>
</div>
<div id="outline-container-orgad92f85" class="outline-4">
<h4 id="orgad92f85">decision data dispatch through tbox (remote CAN, 4G and ccp) to VBU</h4>
</div>
</div>
<div id="outline-container-org903d934" class="outline-3">
<h3 id="org903d934">training</h3>
<div class="outline-text-3" id="text-org903d934">
</div>
<div id="outline-container-org437ecb4" class="outline-4">
<h4 id="org437ecb4">online (off policy): upload on the cloud, dispatch</h4>
</div>
<div id="outline-container-org4d08998" class="outline-4">
<h4 id="org4d08998">offline: upload, storage and offline training</h4>
</div>
</div>
<div id="outline-container-org569dd7a" class="outline-3">
<h3 id="org569dd7a">data</h3>
<div class="outline-text-3" id="text-org569dd7a">
</div>
<div id="outline-container-org7b0fa6a" class="outline-4">
<h4 id="org7b0fa6a">cloud</h4>
<div class="outline-text-4" id="text-org7b0fa6a">
</div>
<ul class="org-ul">
<li><a id="org111b7fa"></a>model data<br /></li>
<li><a id="org659a59f"></a>training data<br />
<ul class="org-ul">
<li><a id="orgd756a23"></a>offline storage<br /></li>
<li><a id="org5054289"></a>2database for inquiry<br /></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc87565d" class="outline-3">
<h3 id="orgc87565d">equipment</h3>
<div class="outline-text-3" id="text-orgc87565d">
</div>
<div id="outline-container-org409b065" class="outline-4">
<h4 id="org409b065">VB sample with</h4>
<div class="outline-text-4" id="text-org409b065">
</div>
<ul class="org-ul">
<li><a id="org59fb239"></a>TBOX<br /></li>
<li><a id="org0a01a0d"></a>VBU<br /></li>
</ul>
</div>
<div id="outline-container-org4d66b5a" class="outline-4">
<h4 id="org4d66b5a">Cloud cluster</h4>
<div class="outline-text-4" id="text-org4d66b5a">
</div>
<ul class="org-ul">
<li><a id="org376cb02"></a>inference<br />
<ul class="org-ul">
<li><a id="org7ee4e9b"></a>runtime<br /></li>
<li><a id="orgf6a7e07"></a>realtime observation transmission<br /></li>
<li><a id="org36caa00"></a>realtime policy execution<br /></li>
</ul>
</li>
<li><a id="orgdd5092a"></a>training<br />
<ul class="org-ul">
<li><a id="org2344a92"></a>database; observation/model/logs storage search and fetch<br /></li>
<li><a id="org32005a5"></a>training runtime<br /></li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb2cd828" class="outline-2">
<h2 id="orgb2cd828"><span class="todo TODO">TODO</span> ADP Plan</h2>
<div class="outline-text-2" id="text-orgb2cd828">
</div>
<div id="outline-container-orgc5d5ae6" class="outline-3">
<h3 id="orgc5d5ae6">Goal</h3>
<div class="outline-text-3" id="text-orgc5d5ae6">
</div>
<div id="outline-container-org56b9a5d" class="outline-4">
<h4 id="org56b9a5d">Priority: function, performance;</h4>
</div>
<div id="outline-container-org941fed3" class="outline-4">
<h4 id="org941fed3">robust (noise?)</h4>
</div>
<div id="outline-container-orgbd5f165" class="outline-4">
<h4 id="orgbd5f165">safety (risk?)</h4>
</div>
</div>
<div id="outline-container-orgd2fcefa" class="outline-3">
<h3 id="orgd2fcefa"><span class="todo TODO">TODO</span> review the interface: requriment vs implementation</h3>
<div class="outline-text-3" id="text-orgd2fcefa">
</div>
<div id="outline-container-orgc41451c" class="outline-4">
<h4 id="orgc41451c">状态读取（上传）以云端为主体: 短消息，快，1.5 秒，上传后在云端存储</h4>
</div>
<div id="outline-container-orgc58b133" class="outline-4">
<h4 id="orgc58b133">刷写（下发）</h4>
</div>
</div>
<div id="outline-container-org9ae6f31" class="outline-3">
<h3 id="org9ae6f31"><span class="todo TODO">TODO</span> test the interface</h3>
<div class="outline-text-3" id="text-org9ae6f31">
</div>
<div id="outline-container-org50ab56f" class="outline-4">
<h4 id="org50ab56f">upload</h4>
</div>
<div id="outline-container-orgf25d186" class="outline-4">
<h4 id="orgf25d186">download</h4>
</div>
</div>
<div id="outline-container-orgfcf38d8" class="outline-3">
<h3 id="orgfcf38d8"><span class="todo TODO">TODO</span> single test vehicle: freeze the 1st version to have a test training and validation</h3>
<div class="outline-text-3" id="text-orgfcf38d8">
</div>
<div id="outline-container-org8f92ef2" class="outline-4">
<h4 id="org8f92ef2"><span class="todo TODO">TODO</span> cloud cluster setup and test</h4>
</div>
<div id="outline-container-orgef119b4" class="outline-4">
<h4 id="orgef119b4"><span class="todo TODO">TODO</span> ddpg/rdpg real-time with remotecan to test the realtimeness</h4>
</div>
<div id="outline-container-org35d1d53" class="outline-4">
<h4 id="org35d1d53"><span class="todo TODO">TODO</span> ddpg/rdpg offline training/learning &amp; realtime inference</h4>
</div>
<div id="outline-container-org13d275d" class="outline-4">
<h4 id="org13d275d"><span class="todo TODO">TODO</span> ddpg/rdgp offline training/learning &amp; inference with big timegap (latency, data loss)</h4>
</div>
</div>
<div id="outline-container-orgf1bdc8e" class="outline-3">
<h3 id="orgf1bdc8e"><span class="todo TODO">TODO</span> review the performance and feasiblity</h3>
<div class="outline-text-3" id="text-orgf1bdc8e">
</div>
</div>
<div id="outline-container-orge2b407c" class="outline-3">
<h3 id="orge2b407c"><span class="todo TODO">TODO</span> batch test: (multiple vehicles)</h3>
<div class="outline-text-3" id="text-orge2b407c">
</div>
</div>
<div id="outline-container-org670a36a" class="outline-3">
<h3 id="org670a36a"><span class="todo TODO">TODO</span> System Concept (different from test concept, final evaluation)</h3>
<div class="outline-text-3" id="text-org670a36a">
</div>
<div id="outline-container-org188f2e8" class="outline-4">
<h4 id="org188f2e8"><span class="todo TODO">TODO</span> Lower Bound: no real-time download and upload, just offline assessment</h4>
<div class="outline-text-4" id="text-org188f2e8">
</div>
<ul class="org-ul">
<li><a id="org8154326"></a>static optimal pedal map with pre-training （urban eco &amp; highway eco &amp; &#x2026; etc. )<br /></li>
</ul>
</div>
<div id="outline-container-orge4a44ce" class="outline-4">
<h4 id="orge4a44ce"><span class="todo TODO">TODO</span> Expected Performance:</h4>
<div class="outline-text-4" id="text-orge4a44ce">
</div>
<ul class="org-ul">
<li><a id="orgdd6dc73"></a>update when scenario changes smoothly MPC (adaptive changing), from urban &#x2013;&gt; highway<br />
<ul class="org-ul">
<li><a id="orgb51abff"></a>pretraining on highway<br /></li>
<li><a id="org3ded891"></a>scenario changes<br /></li>
<li><a id="org8cd71b1"></a>online update in urban street<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgfae1cc9" class="outline-4">
<h4 id="orgfae1cc9"><span class="todo TODO">TODO</span> Upper Bound:</h4>
<div class="outline-text-4" id="text-orgfae1cc9">
</div>
<ul class="org-ul">
<li><a id="org022a806"></a>realtime dynamic optimal pedal map with online updating (5s observation immediate after flashing/download;)<br />
<div class="outline-text-5" id="text-org022a806">
<p>
<a href="./20220406134513-veos_adp.html">veos-adp</a>
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9f2abe7" class="outline-2">
<h2 id="org9f2abe7">EC1 Training</h2>
<div class="outline-text-2" id="text-org9f2abe7">
</div>
<div id="outline-container-org309f944" class="outline-3">
<h3 id="org309f944">Responsibility</h3>
<div class="outline-text-3" id="text-org309f944">
</div>
<div id="outline-container-org53a147b" class="outline-4">
<h4 id="org53a147b"><span class="todo TODO">TODO</span> provide methods and instruction, analysis of the training data, debugging</h4>
</div>
<div id="outline-container-org4f25ae4" class="outline-4">
<h4 id="org4f25ae4">No support for actual testing,</h4>
</div>
</div>
<div id="outline-container-org61b3d8b" class="outline-3">
<h3 id="org61b3d8b">high quality training (due to inference only mode in EC1)</h3>
<div class="outline-text-3" id="text-org61b3d8b">
</div>
<div id="outline-container-org03036f5" class="outline-4">
<h4 id="org03036f5"><span class="todo TODO">TODO</span> quality and efficiency assessment (eos/)</h4>
</div>
<div id="outline-container-org1cf1126" class="outline-4">
<h4 id="org1cf1126">Anting training is better than Jiangyin.</h4>
</div>
<div id="outline-container-org5e7c100" class="outline-4">
<h4 id="org5e7c100">If no training in Anting, only depending training in Jiangyin, already specified (assessing quality of the training based on the specification！)</h4>
</div>
</div>
<div id="outline-container-org9802eb8" class="outline-3">
<h3 id="org9802eb8">high quality remotecan signal, responsibility?</h3>
<div class="outline-text-3" id="text-org9802eb8">
</div>
<div id="outline-container-org2737606" class="outline-4">
<h4 id="org2737606"><span class="todo TODO">TODO</span> quality assessemnt (eos/remotecan itself)</h4>
</div>
<div id="outline-container-org728fbb1" class="outline-4">
<h4 id="org728fbb1"><span class="todo TODO">TODO</span> improve remotecan?</h4>
<div class="outline-text-4" id="text-org728fbb1">
</div>
<ul class="org-ul">
<li><a id="org7618589"></a>if no, decision for abandoning improvement? resource/timing/difficulty, argument?<br /></li>
<li><a id="org74d5de6"></a><span class="todo TODO">TODO</span> if yes, how?<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org44c359f" class="outline-3">
<h3 id="org44c359f">Analysis</h3>
<div class="outline-text-3" id="text-org44c359f">
</div>
<div id="outline-container-orgbff1697" class="outline-4">
<h4 id="orgbff1697"><span class="todo TODO">TODO</span> Development test</h4>
<div class="outline-text-4" id="text-orgbff1697">
</div>
<ul class="org-ul">
<li><a id="orgf5dacb2"></a>minimum 1 month, 3 weeks is insufficient, will have to debug remotely<br /></li>
</ul>
</div>
<div id="outline-container-org0db9b8d" class="outline-4">
<h4 id="org0db9b8d"><span class="todo TODO">TODO</span> training with new version</h4>
</div>
<div id="outline-container-orgb3e864c" class="outline-4">
<h4 id="orgb3e864c"><span class="todo TODO">TODO</span> inference with new version</h4>
</div>
</div>
</div>
<div id="outline-container-org4008a9a" class="outline-2">
<h2 id="org4008a9a"><span class="todo TODO">TODO</span> EC1 assessemnt</h2>
<div class="outline-text-2" id="text-org4008a9a">
</div>
<div id="outline-container-org6ff74f7" class="outline-3">
<h3 id="org6ff74f7"><span class="todo TODO">TODO</span> safety, again?</h3>
</div>
<div id="outline-container-orgd794cfb" class="outline-3">
<h3 id="orgd794cfb"><span class="todo TODO">TODO</span> efficiency? not included.</h3>
</div>
<div id="outline-container-org748d27e" class="outline-3">
<h3 id="org748d27e"><span class="todo TODO">TODO</span> Not responsible for evaluation, already proved in ADP, with the best algorithm deep rl!</h3>
</div>
<div id="outline-container-orgd99f133" class="outline-3">
<h3 id="orgd99f133"><span class="todo TODO">TODO</span> only support for analysis</h3>
</div>
</div>
<div id="outline-container-orgd253ac8" class="outline-2">
<h2 id="orgd253ac8">EOS Software</h2>
<div class="outline-text-2" id="text-orgd253ac8">
</div>
<div id="outline-container-org92e560f" class="outline-3">
<h3 id="org92e560f">Production level software packaage</h3>
</div>
