content/roam/20211012160401-veos_production_plan.org
** scalable, cluster ready
*** algorithms, tensorflow on cluster, optimized
*** Data storage solution: tailored time series database (faster than MongoDB)
**** arrow parquet - columnar
**** avro - row based, variable length records
**** unified interface for record & episode based storage and sampling
**** metadata solution and interface
**** basis for offline reinforcement learning
*** Data Processing interface
**** Timestamping
**** Bits precise with Schema
**** Full integration with Pandas 2.0 processing (multiindex, null typing,)
**** tensor based vector analysis
**** variable sequence-length processing and storage
*** Vector logging analysis: fast statistics extraction and timing analysis, fast signal quality anaylis and validation
*** EOS Exception handling
** Full typing with mypy, dataclass and pydantic
*** mypy config on package and module levels
*** create stubs for own modules and class
*** overriding optional with constructors
** Extendable architecture
*** integration of multiple input interface (local/remote)
*** integration of multiple storage interface (database, local files, cluster interface)
*** integration of polymorphic agent (DDPG/RDPG)
*** Production configuration system with validation: Vehicle/Driver/Storage config, VCU, TBox, Driver management
*** TODO DL training/testing metrics with W&B
*** TODO Time series processing with Transformer architecture
*** TODO Offline Reinforcement Learning investigation, EDA of offline data
*** TODO Foundational Model for VEOS （prediction and decision, LLM-agent)
*** TODO Spark extention to Eos Storage
*** TODO MapReduce pipeline for veos analysis: statistics,
* EOS Algorithms
** Offline Reinforcement Learning CQL, etc.
** Transformer substitute LSTM
** Foundational Model for time series
