20211012160401-veos_production_plan.html
<div id="outline-container-orga7dbd9a" class="outline-3">
<h3 id="orga7dbd9a">scalable, cluster ready</h3>
<div class="outline-text-3" id="text-orga7dbd9a">
</div>
<div id="outline-container-org7f8a41e" class="outline-4">
<h4 id="org7f8a41e">algorithms, tensorflow on cluster, optimized</h4>
</div>
<div id="outline-container-org287268f" class="outline-4">
<h4 id="org287268f">Data storage solution: tailored time series database (faster than MongoDB)</h4>
<div class="outline-text-4" id="text-org287268f">
</div>
<ul class="org-ul">
<li><a id="org20e4b0c"></a>arrow parquet - columnar<br /></li>
<li><a id="org3c7faab"></a>avro - row based, variable length records<br /></li>
<li><a id="org9b73569"></a>unified interface for record &amp; episode based storage and sampling<br /></li>
<li><a id="org77857a9"></a>metadata solution and interface<br /></li>
<li><a id="orga9e0b87"></a>basis for offline reinforcement learning<br /></li>
</ul>
</div>
<div id="outline-container-orgf362476" class="outline-4">
<h4 id="orgf362476">Data Processing interface</h4>
<div class="outline-text-4" id="text-orgf362476">
</div>
<ul class="org-ul">
<li><a id="org364f4be"></a>Timestamping<br /></li>
<li><a id="org09fd9f7"></a>Bits precise with Schema<br /></li>
<li><a id="orga0bb229"></a>Full integration with Pandas 2.0 processing (multiindex, null typing,)<br /></li>
<li><a id="org719c813"></a>tensor based vector analysis<br /></li>
<li><a id="org4ae81ef"></a>variable sequence-length processing and storage<br /></li>
</ul>
</div>
<div id="outline-container-orgd930170" class="outline-4">
<h4 id="orgd930170">Vector logging analysis: fast statistics extraction and timing analysis, fast signal quality anaylis and validation</h4>
</div>
<div id="outline-container-org579fa8e" class="outline-4">
<h4 id="org579fa8e">EOS Exception handling</h4>
</div>
</div>
<div id="outline-container-org70f5a7f" class="outline-3">
<h3 id="org70f5a7f">Full typing with mypy, dataclass and pydantic</h3>
<div class="outline-text-3" id="text-org70f5a7f">
</div>
<div id="outline-container-orgdbdae17" class="outline-4">
<h4 id="orgdbdae17">mypy config on package and module levels</h4>
</div>
<div id="outline-container-org83e5468" class="outline-4">
<h4 id="org83e5468">create stubs for own modules and class</h4>
</div>
<div id="outline-container-orgdf074fb" class="outline-4">
<h4 id="orgdf074fb">overriding optional with constructors</h4>
</div>
</div>
<div id="outline-container-org9841769" class="outline-3">
<h3 id="org9841769">Extendable architecture</h3>
<div class="outline-text-3" id="text-org9841769">
</div>
<div id="outline-container-orgb22f9d4" class="outline-4">
<h4 id="orgb22f9d4">integration of multiple input interface (local/remote)</h4>
</div>
<div id="outline-container-org3d93523" class="outline-4">
<h4 id="org3d93523">integration of multiple storage interface (database, local files, cluster interface)</h4>
</div>
<div id="outline-container-orgb6f4b3d" class="outline-4">
<h4 id="orgb6f4b3d">integration of polymorphic agent (DDPG/RDPG)</h4>
</div>
<div id="outline-container-orgc2d9629" class="outline-4">
<h4 id="orgc2d9629">Production configuration system with validation: Vehicle/Driver/Storage config, VCU, TBox, Driver management</h4>
</div>
<div id="outline-container-orgce28f39" class="outline-4">
<h4 id="orgce28f39"><span class="todo TODO">TODO</span> DL training/testing metrics with W&amp;B</h4>
</div>
<div id="outline-container-orga2ff6a5" class="outline-4">
<h4 id="orga2ff6a5"><span class="todo TODO">TODO</span> Time series processing with Transformer architecture</h4>
</div>
<div id="outline-container-orgfbfb27c" class="outline-4">
<h4 id="orgfbfb27c"><span class="todo TODO">TODO</span> Offline Reinforcement Learning investigation, EDA of offline data</h4>
</div>
<div id="outline-container-orgb9841fc" class="outline-4">
<h4 id="orgb9841fc"><span class="todo TODO">TODO</span> Foundational Model for VEOS （prediction and decision, LLM-agent)</h4>
</div>
<div id="outline-container-orgf86c965" class="outline-4">
<h4 id="orgf86c965"><span class="todo TODO">TODO</span> Spark extention to Eos Storage</h4>
</div>
<div id="outline-container-org9fd4071" class="outline-4">
<h4 id="org9fd4071"><span class="todo TODO">TODO</span> MapReduce pipeline for veos analysis: statistics,</h4>
</div>
</div>
</div>
<div id="outline-container-org6cfcd15" class="outline-2">
<h2 id="org6cfcd15">EOS Algorithms</h2>
<div class="outline-text-2" id="text-org6cfcd15">
</div>
<div id="outline-container-org4527239" class="outline-3">
<h3 id="org4527239">Offline Reinforcement Learning CQL, etc.</h3>
</div>
<div id="outline-container-org18745e0" class="outline-3">
<h3 id="org18745e0">Transformer substitute LSTM</h3>
</div>
<div id="outline-container-orgcf58da2" class="outline-3">
<h3 id="orgcf58da2">Foundational Model for time series</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
